---
kind: property
id: P:Autodesk.Revit.DB.Visual.Generic.GenericCutoutOpacity
source: html/a357afa0-127b-e03b-92d7-77faa789d535.htm
---
# Autodesk.Revit.DB.Visual.Generic.GenericCutoutOpacity Property

The property labeled "Cutouts" from the "Generic" schema.

## Syntax (C#)
```csharp
public static string GenericCutoutOpacity { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".
 This property allows a connected asset.